orchestrations/WeatherProxyComponent/test/WeatherProxyInvoker/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:weat="http://modalis.i3s.unice.fr/jSeduite/schema/WeatherProxy">
  <soapenv:Body>
    <weat:WeatherProxyRequest>
      <weat:CityCode>62201</weat:CityCode>
    </weat:WeatherProxyRequest>
  </soapenv:Body>
</soapenv:Envelope>